[
    "In the Laboratory and Armory, you can make \"friend discounts\" by combining mana from all allies on adjacent shop tiles.",
    "After a joint purchase, the shop goes on cooldown for all heroes whose mana participated in the deal.",
    "Only one item can be purchased per shop visit.",
    "You can browse the shop window as much as you want — only the actual purchase counts as an action.",
    "Purchase is impossible without a free inventory slot.",
    "The Magic Shop is paid for with gold and never goes on cooldown.",
    "In the Magic Shop, you can take multiple items in one visit.",
    "The zone of any allied building must not overlap more than four adjacent tiles of one shop.",
    "Walls are forbidden to be placed directly adjacent to shops.",
    "Any purchase in the Armory or Laboratory puts that shop on a six-turn cooldown (Magic Shop is unaffected).",
    "You cannot move and act \"before and after\" — movement is performed once per turn.",
    "Heroes move only in four directions; diagonals are forbidden.",
    "A regular step costs one agility per empty tile.",
    "Without special abilities, you cannot pass through buildings and other characters.",
    "If a teleport is placed on an occupied tile, the hero appears on the nearest free tile.",
    "\"Movement to point\" does not pass through walls — it's still regular movement.",
    "Area abilities pass through walls and characters, operating at height 1.",
    "A beam hits through heroes but stops at the first building.",
    "The \"Flight\" effect raises the hero +1 to height.",
    "Jumping through a portal doesn't count as movement and doesn't require agility.",
    "You can \"step\" through a portal and stay in place.",
    "It's enough to close one portal for the entire connection to stop working.",
    "A portal lies at height 0, so you can shoot through it.",
    "The Temple restores 250 mana per turn to allies if they stand on the green cross.",
    "To repaint a temple, you must stand on the cross for three consecutive turns.",
    "Temples are invulnerable: they have no health points.",
    "Buildings cannot affect the green cross tiles of a temple.",
    "Creeps respawn every five turns, starting from the fifth.",
    "For killing a creep, the team receives 100 gold to the common balance.",
    "Towers and areas do not damage creeps — they are neutral.",
    "Moving through bushes requires two agility per tile.",
    "Entering bushes costs 1 agility, exiting back costs 2.",
    "Range in bushes is halved, rounding up.",
    "Against a target in bushes, regular attacks have a 33% miss chance.",
    "When shooting through bushes at an enemy on the other side, miss doesn't count.",
    "A hero flying over bushes receives neither bonuses nor penalties from this zone.",
    "A purchased wall starts with 750 HP.",
    "At 375 HP and below, a wall is considered half-destroyed and impassable.",
    "Starting walls are invulnerable and always intact.",
    "No areas or building effects damage walls.",
    "Standing on a wall, a hero gains increased height.",
    "Walls themselves are neutral buildings and don't belong to players.",
    "\"Effect application\" can grant shield, flight, or invisibility.",
    "\"Mode\" abilities change multiple hero characteristics at once.",
    "A \"3 × 3\" size record means a square area with the hero in the center.",
    "If beam length is not specified, it equals the hero's current range.",
    "\"Movement to point\" costs agility, teleportation doesn't.",
    "An enemy hero will never receive mana from your temple.",
    "During temple capture, mana is temporarily not given.",
    "The blue square is almost completely closed for construction — except for Lightning Rod.",
    "Red and blue portals form pairs across the map center.",
    "A portal opens upward infinitely but doesn't work underground.",
    "A Kobold underground cannot enter a portal from height –1.",
    "If a creep has lived five turns, its health and armor are fully restored.",
    "Base creep stats — 200 HP, 100 physical damage, 1 armor.",
    "Creeps have neither mana nor agility.",
    "A creep attacks only one target with the lowest HP per round.",
    "Change from joint purchase is distributed by the player as desired.",
    "Damage enhancement can cost a character all accumulated mana.",
    "Walls remain intact even under fire from towers or turrets.",
    "During temple capture, a hero doesn't receive mana.",
    "\"Building construction\" places an object on any free tile within range.",
    "A summoned creature can be controlled with a separate turn action.",
    "Teleportation can move a hero to the enemy half if range allows.",
    "A beam with movement pulls the hero through enemies in a straight line.",
    "However, such a dash will stop as soon as it hits a building.",
    "An area affects only its height level unless otherwise specified.",
    "Miss due to bushes applies only to regular attacks, not abilities.",
    "Area damage never affects buildings, only creatures and heroes.",
    "The healing zone around the base doesn't extend to adjacent walls.",
    "Walls themselves have a height of one block.",
    "Teleportation is forbidden inside the red starting square.",
    "Building effects don't enter the red square.",
    "\"Cross\" as an area shape covers four directions by radius.",
    "Summoned creatures inherit the construction rules of regular buildings.",
    "At the start of the match, each player randomly receives five unique heroes.",
    "On a wall, a hero is considered elevated above the field, which benefits shooters.",
    "The red square is invulnerable to building effects.",
    "A building cannot be placed so that its zone overlaps the temple's green cross.",
    "Each base has its own Magic Shop, accessible to both sides.",
    "The Magic Shop follows the same tile blocking rules as others.",
    "A joint deal cools down the shop immediately for all contributing heroes.",
    "By default, diamond is the basic shape of any area.",
    "With a square area, the hero is positioned strictly in the center of the template.",
    "Bushes are indestructible by any type of damage.",
    "\"Healing zone\" adds 25 HP to allies each of their turns.",
    "The healing zone doesn't remove debuffs, only heals.",
    "Areas of abilities and items don't affect neutral buildings.",
    "Regular attacks don't pass through other heroes and buildings without special properties.",
    "Creeps on different maps may differ, but the 200/100/1 standard remains.",
    "A creep lair is marked with a three-claw icon.",
    "The healing effect only works on green tiles of the healing zone.",
    "A building cannot be erected inside the blue square, but its zone can extend there.",
    "In one turn, you can place as many walls from your inventory as you want.",
    "A purchased turret can be placed anywhere on your half, even while standing at the shop.",
    "On the enemy half, a building can only be placed on an adjacent tile.",
    "Towers and turrets aren't built beyond the front line, but their firing zone can extend there.",
    "An item-area won't touch a neutral building — even a wall.",
    "Building construction always counts as an action.",
    "You cannot build if the building's zone overlaps more than four shop tiles or affects the base's mana zone."
]