[
    "В Лаборатории и Оружейной можно делать \"скидку с друзей\", объединяя ману всех союзников на соседних клетках магазина.",
    "После совместной покупки магазин уходит в перезарядку для всех героев, чья мана участвовала в сделке.",
    "За один визит в магазин разрешено приобрести ровно один товар.",
    "Смотреть витрину можно сколько угодно — действием считается только сама покупка.",
    "Без свободного слота в инвентаре покупка невозможна.",
    "Магический магазин расплачивается золотом и никогда не уходит на кулдаун.",
    "В Магическом магазине можно взять сразу несколько предметов за один заход.",
    "Зона любой союзной постройки не должна перекрывать более четырёх соседних клеток одного магазина.",
    "Стены запрещается ставить вплотную к магазинам.",
    "Любая покупка в Оружейной или Лаборатории ставит этот магазин на шестиходовую перезарядку (Магический не трогается).",
    "Переместиться и действовать \"до и после\" нельзя — движение выполняется один раз за ход.",
    "Герои ходят только по четырём направлениям; диагонали запрещены.",
    "Обычный шаг тратит одну ловкость за пустую клетку.",
    "Без особых умений нельзя проходить сквозь постройки и других персонажей.",
    "Если телепорт ставят на занятую клетку, герой встаёт на ближайшую свободную.",
    "\"Перемещение в точку\" не пролезает сквозь стены — это всё ещё обычное движение.",
    "Способности-области проходят сквозь стены и персонажей, работая на высоте 1.",
    "Луч бьёт сквозь героев, но останавливается на первой постройке.",
    "Эффект \"Полет\" поднимает героя на +1 к высоте.",
    "Прыжок через портал не считается перемещением и не требует ловкости.",
    "Через портал можно «шагнуть» и остаться на месте.",
    "Достаточно закрыть один портал, чтобы вся связка перестала работать.",
    "Портал лежит на высоте 0, поэтому через него можно стрелять.",
    "Храм восстанавливает союзникам 250 маны за ход, если они стоят на зелёном кресте.",
    "Чтобы перекрасить храм, простоишь на кресте три хода подряд.",
    "Храмы неуязвимы: у них нет очков здоровья.",
    "Постройки не могут затрагивать клетки зелёного креста у храма.",
    "Крипы возрождаются каждые пять ходов, начиная с пятого.",
    "За добивание крипа команда получает 100 золота на общий баланс.",
    "Башни и области не наносят урона крипам — они нейтральны.",
    "Ход через кусты требует две ловкости за клетку.",
    "Вход в кусты — 1 ловкость, выход обратно — 2.",
    "Дальность в кустах сокращается вдвое, округляя вверх.",
    "По цели в кустах обычная атака имеет 33 % шанс промаха.",
    "Стреляя сквозь кусты по врагу по другую сторону, промах не считается.",
    "Летящий над кустами герой не получает ни бонусов, ни штрафов этой зоны.",
    "Покупная стена стартует с 750 НР.",
    "При 375 НР и ниже стена считается полуразрушенной и непроходимой.",
    "Начальные стены неуязвимы и всегда целы.",
    "Никакие области и эффекты построек не повреждают стены.",
    "Стоя на стене, герой получает увеличенную высоту.",
    "Сами стены — нейтральные постройки и не принадлежат игрокам.",
    "\"Наложение эффекта\" может дать щит, полёт или невидимость.",
    "Способности-\"Режимы\" меняют сразу несколько характеристик героя.",
    "Запись размера \"3 × 3\" означает квадратную область с героем в центре.",
    "Если длина луча не указана, она равна текущей дальности героя.",
    "\"Перемещение в точку\" тратит ловкость, а телепортация — нет.",
    "Вражеский герой никогда не получит ману из вашего храма.",
    "При захвате храма мана временно не выдаётся.",
    "Синий квадрат почти полностью закрыт для строительства — кроме Громоотвода.",
    "Красные и синие порталы образуют пары через середину карты.",
    "Портал открыт вверх бесконечно, но не работает под землёй.",
    "Кобольд под землёй не может войти в портал с высоты –1.",
    "Если крип прожил пять ходов, его здоровье и броня полностью восстанавливаются.",
    "Базовые статы крипа — 200 НР, 100 физического урона, 1 броня.",
    "У крипов нет ни маны, ни ловкости.",
    "Крип атакует только одну цель с наименьшим НР за раунд.",
    "Сдачу маны после совместной покупки игрок распределяет как хочет.",
    "Усиление урона может стоить персонажу всю накопленную ману.",
    "Стены остаются целыми даже под огнём башен или турелей.",
    "Во время захвата храма герой не получает маны.",
    "\"Возведение постройки\" размещает объект на любую свободную клетку в пределах дальности.",
    "Призванным существом можно управлять отдельным действием хода.",
    "Телепортация может перенести героя на вражескую половину, если радиус позволяет.",
    "Луч с перемещением тянет героя сквозь врагов по прямой.",
    "Однако такой рывок остановится, как только упрётся в постройку.",
    "Область действует только на своём уровне высоты, если не указано иное.",
    "Промах из-за кустов относится только к обычным атакам, а не к способностям.",
    "Урон по области никогда не задевает постройки, только существ и героев.",
    "Зона лечения вокруг базы не распространяется на прилегающие стены.",
    "Сами стены имеют высоту один блок.",
    "Телепортация запрещена внутрь красного квадрата старта.",
    "Эффекты построек не заходят в красный квадрат.",
    "\"Крест\" как форма области охватывает четыре направления по радиусу.",
    "Призванные существа наследуют правила возведения обычных построек.",
    "В начале партии каждый игрок случайно получает пятёрку уникальных героев.",
    "На стене герой считается приподнятым над полем, что выгодно стрелкам.",
    "Красный квадрат неуязвим для эффектов построек.",
    "Постройку нельзя ставить так, чтобы её зона перекрывала зелёный крест храма.",
    "У каждой базы есть собственный Магический магазин, доступный обеим сторонам.",
    "Магический магазин подчиняется тем же правилам блокировки клеток, что и остальные.",
    "Совместная сделка охлаждает магазин сразу для всех вложившихся героев.",
    "По умолчанию ромб — базовая форма любой области.",
    "При квадратной области герой располагается строго в центре шаблона.",
    "Кусты нерушимы любым видом урона.",
    "\"Зона лечения\" прибавляет 25 НР союзникам каждый их ход.",
    "Исцеляющая зона не снимает дебафы, а лишь лечит.",
    "Области способностей и предметов не затрагивают нейтральные постройки.",
    "Обычные атаки не проходят сквозь других героев и постройки без особых свойств.",
    "Крипы на разных картах могут отличаться, но стандарт 200/100/1 остаётся.",
    "Логово крипа отмечено значком трёх когтей.",
    "Эффект исцеления действует только на зелёные клетки зоны лечения.",
    "Постройку нельзя возвести внутри синего квадрата, но её зона может туда зайти.",
    "За один ход можно поставить сколько угодно стен из своего инвентаря.",
    "Купленную турель можно поставить где угодно на своей половине, даже стоя у магазина.",
    "На чужой половине постройку разрешено ставить только на соседнюю клетку.",
    "Башни и турели не строятся за линией фронта, но их зона стрельбы может туда заходить.",
    "Предмет-область не тронет нейтральную постройку — даже стену.",
    "Возведение постройки всегда считается действием.",
    "Нельзя строить, если зона постройки перекрывает более четырёх клеток магазина или затрагивает маназону базы."
  ]
  